Revit 2027 API
FabricationPart.GetRodInfo Method
 Gets the fabrication rod information.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FabricationRodInfo GetRodInfo()
Public Function GetRodInfo As FabricationRodInfo
public:
FabricationRodInfo^ GetRodInfo()
member GetRodInfo : unit -> FabricationRodInfo
Return Value
FabricationRodInfo
 The fabrication rod information. Returns null if the fabrication part does not have any rod.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace